In [3]:
import pandas as pd

x= {'Student': ['David', 'Samuel', 'Terry', 'Evan'], 'Age': ['27', '24', '22', '32'], 'Country': ['UK', 'Canada', 'China', 'USA'],
    'Course': ['Python','Data Structures','Machine Learning','Web Development'], 'Marks':['85','72','89','76']}

df = pd.DataFrame(x)
df

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [6]:
#Retrieve the Marks column and assign it to a variable b

b= df[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [7]:
#Retrieve the Country and Course columns and assign it to a variable c

c = df[['Country', 'Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [8]:
# Get the Student column as a series Object

d = df['Student']
d

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

In [9]:
#check the type of x

type(d)

pandas.core.series.Series